<template>
    <SideBarComponent>
        <h1>2024年度の加入方法について</h1>
        <p>新入生歓迎期間は5月31日(金)で終了させていただきました。これ以降の加入申請は、個別対応となります。</p>

        <h1>新入生歓迎会について</h1>
        <p>2024年度の新入生歓迎会は対面開催を予定しています！<br>詳しい情報は、Discordにてお知らせします。ぜひ入ってください！</p>

        <h2>Discordサーバーへの入り方</h2>
        <p>
            こちらのリンクから入ることができます。<br>
            <a href="https://discord.gg/GJUUr8cr8e" target="_blank">https://discord.gg/GJUUr8cr8e</a>
        </p>

        <h2>新入生歓迎会の内容 (予定)</h2>
        <ul>
            <li>団体紹介<br>（紹介する内容は、このページの内容より詳しいです）</li>
            <li>私たちが開発しているアプリの紹介</li>
            <li>ソフトウェア開発にも欠かせない！<br>「伝わるスライド資料の作り方」ミニ講座</li>
        </ul>

        <h1>団体紹介</h1>
        <p>私たちについてご紹介します！<br>ちょっと長いですが、基本的な情報はこのページにすべて載っています。</p>

        <h2>これまでの活動と歴史</h2>
        <p>私たちは2023年6月に設立されたクリエプロジェクトです。</p>
        <p>ただプログラミングを学ぶだけではなく、その技術によって社会の問題や身近な問題を解決するスキルを身に着けたいと考え、このプロジェクトを立ち上げました。</p>

        <h2>活動内容</h2>
        <p>主な活動内容はソフトウェア開発です。</p>
        <p>現在はWebアプリの開発に力を入れていますが、これまでの活動にとらわれず取り組んでいきたいと考えています。作りたいものがある方は、ぜひお越しください！</p>
        <p>また、技術習得のために競技プログラミングにも参加しています。競技プログラミングとは、限られた時間内で特定の問題を解くコーディング競技です。毎週開催される「AtCoder Beginner Contest
            (ABC)」などに参加しています。</p>
        <p>より良いソフトウェアを開発するには、幅広い知識と技術が必要です。AppLiiでは、それぞれのメンバーが主体性を持って学習に取り組むことを大切にしています。したがって、自主学習も活動のひとつになります。</p>

        <h2>これまでの実績と開発</h2>
        <p>現在は「大学食堂混雑アプリ(仮)」のリリースに向けて活動しています。このアプリについては、<a href="/pages/about-cafe-app">こちらのページ</a> をご覧ください！</p>
        <p>また、このアプリは
            <a href="https://www.wakayama-u.ac.jp/crea/crea-project/project/mission.html">
                2023年度のクリエミッションとして採択され、予算を割り当てられて</a>
            開発を進めています。
        </p>

        <h2>活動頻度</h2>
        <p>私たちは、以下2つの定期活動を中心に運営しています。</p>
        <ul>
            <li> 技術交流会・会議（2週間ごと・曜日はアンケートで決定） </li>
            <li> 競技プログラミングへの参加（1週間ごと・土曜か日曜） </li>
        </ul>
        <p>しかし、必ず参加しないといけない活動はありません。興味のある活動に参加することができます。</p>
        <p>クリエミッションや自主演習を利用する方は、発表会や申請締切の直前にもう少し忙しくなります。</p>

        <h2>年間活動スケジュール</h2>
        <p>クリエミッションや自主演習、大学外のコンテストなど、さまざまなイベントに合わせて活動を行っています。こちらも定期的な活動と同じように、必ず参加しないといけない活動はありません。皆さんの興味や目標に合わせて活動することができます。
        </p>

        <h2>活動費用</h2>
        <p>年会費や参加費はありません。</p>
        <p>ただし、AppLiiなどのクリエプロジェクトに参加するためには、学研災付帯賠償責任保険（通称：学研賠、年間340円）への加入が必要です。この加入方法は、学生支援課にご相談ください。</p>
        <p>また、個人でツールなどを利用する場合、さらに活動費用が発生することがあります。例えば、去年は以下のような有料サービスを利用していました。</p>
        <ul>
            <li> ChatGPT Plus（月20ドル） </li>
            <li> Microsoft Azure（月1,000円くらい） </li>
            <li> Google Workspace（月680円） </li>
        </ul>
        <p>これらのツールは開発に必須ではないため、必要に応じて自由に選んで利用する方針となっています。</p>

        <h2>ツール紹介（連絡手段）</h2>
        <p>AppLiiでは、メインのコミュニケーション手段としてDiscordを使っています。Discordサーバーでは、気楽に雑談したり、思いついたアイデアを持ち寄ったり、プログラミングの困り事を共有したりしています。また、Slackなども導入を検討しています。
        </p>

        <h2>ツール紹介（開発）</h2>
        <p>ソフトウェア開発には、さまざまなツールを活用しています。新しいツールでも積極的に取り入れて、開発を効率化しようと心がけています。現在はGitHubやChatGPTなどを使用していますが、具体的なツール紹介はこちらの記事を御覧ください。
        </p>

        <h2>活動で身につけられるもの</h2>
        <p>AppLiiでは、ソフトウェアエンジニアとして必要な幅広い能力の獲得を目指しています。</p>
        <p>プログラミング技術の向上は基本としつつ、チームでの共同開発、プロジェクト管理、効果的なコミュニケーション能力の育成にも注力しています。授業では体験できない実践的な経験を通して、多様なスキルを高めていくことが私たちの目標です。これらのスキルを身につけるために、私たちは日々努力を重ね、活動を続けています。
        </p>
    </SideBarComponent>
</template>

<script>
import SideBarComponent from '~/components/SideBarComponent.vue';

export default {
    name: 'NewcomersPage',
    components: {
        SideBarComponent
    },
}
</script>

<script setup>
useHead({
    title: '新入生歓迎会について｜AppLii',
    meta: [
        { name: 'description', content: '新入生歓迎会についてご紹介します。' },
        { property: 'og:title', content: '新入生歓迎会について｜AppLii' },
        { property: 'og:description', content: '新入生歓迎会についてご紹介します。' },
    ],
})
</script>

<style scoped lang="scss"></style>